<h1>Оглавление<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Информация-об-исследовании-и-обрабатываемых-данных." data-toc-modified-id="Информация-об-исследовании-и-обрабатываемых-данных.-1">Информация об исследовании и обрабатываемых данных.</a></span></li><li><span><a href="#Предварительное-изучение-таблиц" data-toc-modified-id="Предварительное-изучение-таблиц-2">Предварительное изучение таблиц</a></span></li><li><span><a href="#Ответы-на-вопросы" data-toc-modified-id="Ответы-на-вопросы-3">Ответы на вопросы</a></span><ul class="toc-item"><li><span><a href="#Cколько-книг-вышло-после-1-января-2000-года?" data-toc-modified-id="Cколько-книг-вышло-после-1-января-2000-года?-3.1">Cколько книг вышло после 1 января 2000 года?</a></span></li><li><span><a href="#Посчитать-количество-обзоров-и-среднюю-оценку-для-каждой-книги." data-toc-modified-id="Посчитать-количество-обзоров-и-среднюю-оценку-для-каждой-книги.-3.2">Посчитать количество обзоров и среднюю оценку для каждой книги.</a></span></li><li><span><a href="#Определить-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц." data-toc-modified-id="Определить-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц.-3.3">Определить издательство, которое выпустило наибольшее число книг толще 50 страниц.</a></span></li><li><span><a href="#Определить-автора-с-самой-высокой-средней-оценкой-книг,-учитывая-только-книги-с-50-и-более-оценками" data-toc-modified-id="Определить-автора-с-самой-высокой-средней-оценкой-книг,-учитывая-только-книги-с-50-и-более-оценками-3.4">Определить автора с самой высокой средней оценкой книг, учитывая только книги с 50 и более оценками</a></span></li><li><span><a href="#Посчитать-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок." data-toc-modified-id="Посчитать-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок.-3.5">Посчитать среднее количество обзоров от пользователей, которые поставили больше 50 оценок.</a></span></li></ul></li><li><span><a href="#Общий-вывод" data-toc-modified-id="Общий-вывод-4">Общий вывод</a></span></li></ul></div>

## Информация об исследовании и обрабатываемых данных.

Задача данного проекта - анализ базы данных сервиса для чтения книг по подписке, содержащей информацию о книгах, издателях, авторах, а также пользовательские обзоры книг.

**Данные представлены следующими таблицами с информацией о книгах.**

Таблица `books` - содержит данные о книгах:
* book_id — идентификатор книги;
* author_id — идентификатор автора;
* title — название книги;
* num_pages — количество страниц;
* publication_date — дата публикации книги;
* publisher_id — идентификатор издателя.

Таблица `authors` - содержит данные об авторах:
* author_id — идентификатор автора;
* author — имя автора.

Таблица `publishers` - содержит данные об издательствах:
* publisher_id — идентификатор издательства;
* publisher — название издательства.

Таблица `ratings` - содержит данные о пользовательских оценках книг:
* rating_id — идентификатор оценки;
* book_id — идентификатор книги;
* username — имя пользователя, оставившего оценку;
* rating — оценка книги.

Таблица `reviews` - содержит данные о пользовательских обзорах на книги:
* review_id — идентификатор обзора;
* book_id — идентификатор книги;
* username — имя пользователя, написавшего обзор;
* text — текст обзора.

**В результате исследования необходимо выявить:**
1. издательство, выпустившее наибольшее число книг (исключая брошюры),
2. автора с самой высокой средней оценкой книг,
3. среднее количество обзоров от пользователей, активно ставящих оценки.

## Предварительное изучение таблиц

In [1]:
import pandas as pd 
from sqlalchemy import create_engine

In [2]:
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net', 
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'], 
 db_config['pwd'], 
 db_config['host'], 
 db_config['port'], 
 db_config['db']) 

# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

Выведем первые строки каждой из таблиц.

In [3]:
for table in ['books', 'authors', 'publishers', 'ratings', 'reviews']:
    query = f'''
    SELECT * 
    FROM {table}
    LIMIT 5
    '''
    result = pd.io.sql.read_sql(query, con=engine)
    display(result)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

Содержимое соответствует заявленному. Можно делать запросы для ответов на поставленные вопросы.

## Ответы на вопросы

### Cколько книг вышло после 1 января 2000 года?

In [4]:
query = f'''
SELECT COUNT(book_id) 
FROM books
WHERE publication_date > '2000-01-01'
'''
result = pd.io.sql.read_sql(query, con=engine)
display(result)

   count
0    819

Чтобы узнать 819, какую часть от общего количества составляют 819 книг, выведем самую первую, самую последнюю даты публикации из таблицы, а также общее количество книг.

In [5]:
query = f'''
SELECT MAX(publication_date),
MIN(publication_date),
COUNT(book_id)
FROM books
'''
result = pd.io.sql.read_sql(query, con=engine)
display(result)

          max         min  count
0  2020-03-31  1952-12-01   1000

Хотя в базе данных имеются книги, опубликованных в 1952 г., основная масса книг опубликована после рассматриваемой нами даты.

### Посчитать количество обзоров и среднюю оценку для каждой книги.

In [6]:
query = f'''
WITH reviews_cnt AS
(SELECT b.book_id,
b.title,
COUNT(review_id) reviews
FROM books b
LEFT JOIN reviews re ON b.book_id = re.book_id
GROUP BY b.book_id, b.title),
rating_avg AS
(SELECT b.book_id,
b.title,
ROUND(AVG(rating), 2) rating
FROM books b
LEFT JOIN ratings r ON b.book_id = r.book_id
GROUP BY b.book_id, b.title)
SELECT re.book_id, re.title, re.reviews, ra.rating
FROM reviews_cnt re
JOIN rating_avg ra ON re.book_id=ra.book_id
'''
result = pd.io.sql.read_sql(query, con=engine)

In [7]:
display(result.sort_values(by='reviews', ascending=False))
display(result.sort_values(by='rating', ascending=False))

,book_id,title,reviews,rating
947,948,Twilight (Twilight #1),7,3.66
962,963,Water for Elephants,6,3.98
732,733,The Giver (The Giver #1),6,3.75
749,750,The Hobbit or There and Back Again,6,4.13
626,627,The Alchemist,6,3.79
...,...,...,...,...
807,808,The Natural Way to Draw,0,3.00
190,191,Disney's Beauty and the Beast (A Little Golden...,0,4.00
220,221,Essential Tales and Poems,0,4.00
386,387,Leonardo's Notebooks,0,4.00
82,83,Anne Rice's The Vampire Lestat: A Graphic Novel,0,3.67

,book_id,title,reviews,rating
597,598,Stolen (Women of the Otherworld #2),2,5.00
552,553,School's Out—Forever (Maximum Ride #2),3,5.00
228,229,Evil Under the Sun (Hercule Poirot #24),2,5.00
641,642,The Big Bad Wolf (Alex Cross #9),2,5.00
223,224,Evening Class,2,5.00
...,...,...,...,...
914,915,The World Is Flat: A Brief History of the Twen...,3,2.25
370,371,Junky,2,2.00
315,316,His Excellency: George Washington,2,2.00
201,202,Drowning Ruth,3,2.00
302,303,Harvesting the Heart,2,1.50

В топе количества отзывов видны популярные книги, а в топе среднего рейтинга - книги с небольшим количеством отзывов.

### Определить издательство, которое выпустило наибольшее число книг толще 50 страниц.

In [8]:
query = f'''
SELECT publisher,
COUNT(book_id) books_count
FROM books b
JOIN publishers p ON b.publisher_id = p.publisher_id 
WHERE num_pages > 50
GROUP BY publisher
ORDER by books_count DESC
LIMIT 1
'''
result = pd.io.sql.read_sql(query, con=engine)
display(result)

       publisher  books_count
0  Penguin Books           42

Penguin Books достаточно популярное издательство, которое выпускает много больших книг.

### Определить автора с самой высокой средней оценкой книг, учитывая только книги с 50 и более оценками

In [9]:
query = f'''
SELECT author,
ROUND(AVG(rating), 2) rating_avg
FROM books b
JOIN authors a ON a.author_id = b.author_id
JOIN ratings r ON b.book_id = r.book_id
WHERE b.book_id in (
    SELECT b.book_id
    FROM books b
    JOIN ratings r ON b.book_id = r.book_id
    GROUP BY b.book_id
    HAVING COUNT(rating_id)>=50
    )
GROUP BY author
ORDER by rating_avg DESC
LIMIT 1
'''
result = pd.io.sql.read_sql(query, con=engine)
display(result)

                       author  rating_avg
0  J.K. Rowling/Mary GrandPré        4.29

Наиболее высокий рейтинг у книг Джоан Роулинг с самым известным вариантом иллюстраций от Mary GrandPré.

### Посчитать среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [10]:
query = f'''
WITH active_users AS
(SELECT username,
COUNT(review_id)
FROM reviews
WHERE username in (
    SELECT username
    FROM ratings
    GROUP BY username
    HAVING COUNT(rating_id)>50
    )
GROUP BY username)
SELECT ROUND(AVG(count), 2)
FROM active_users
'''
result = pd.io.sql.read_sql(query, con=engine)
display(result)

   round
0  24.33

Пользователи, которые часто ставят оценки, также оставляют достаточно много обзоров.

## Общий вывод

В базе всего 1000 книг: она небольшая. Книги все современные XX века. Но есть популярные книги, есть книги с хорошими отзывами, которые активно оставляют читатели. 

Если планируется расширять базу книг и поддерживать активность, то можно такой сервис купить.